Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_post_primary_school/post_primary_education_life_event.html.txt.tmx
Source language: en
Languages: ga

source: The post-primary or second-level education caters for students aged 12 to 18 years
ga: Freastalaítear ar oideachas daltaí 12 go 18 aois san earnáil iarbhunoideachais

source: Attendance at school is compulsory for students aged under 16. Most children start in post-primary school at the age of 12 or 13
ga: Is éigeantach freastal ar scoil iarbhunoideachais do mhic léinn atá faoi 16 bliana d’aois

source: They must be at least 12 years of age on 1 January in the year they start second-level education in order to be registered in a post-primary school
ga: Tosaíonn an chuid is mó de leanaí le hoideachas dara leibhéil (ar a dtugtariarbhunscoil) ag 12 nó 13 bliana d’aois

source: There are different types of post-primary school
ga: Tá cineálacha éagsúla iar-bhunscoileanna ann

source: Choosing a post-primary school
ga: Chun scoil iarbhunoideachais a roghnú

source: In most rural and provincial areas, there is generally one school that is attended by all the students in that area
ga: I gceantair tuaithe agus i mbailte, bíonn scoil amháin ann go ginearálta a bhfreastalaíonn na mic léinn ar fad sa cheantar uirthi

source: However, some parents and students, especially in large population centres, may have a choice of schools
ga: Is féidir, áfach, go bhfuil rogha scoileanna ag cuid de thuismitheoirí agus mic léinn, go háirithe i gcathracha nó in áiteanna a bhfuil daonra mór iontu

source: The factors to consider when choosing a school include:
ga: Tá tosca éagsúla anseo ar féidir gur mian leat smaoineamh orthu agus tú ag rogha iar-bhunscoile:

source: • The admissions policy: This should be described in the school plan, which the school is obliged to publish
ga: • Polasaí iontrála: Ní mór cuir síos a dhéanamh air seo i bplean na scoile, atá ar an scoil a fhoilsiú

source: • The curriculum: the range of subjects offered by the school
ga: • An Curaclam: réimse ábhar atá a dteagasc ag an scoil

source: • School discipline: Under the Education (Welfare) Act 2000 (pdf) the board of management is obliged to draw up a code of behaviour for students
ga: • Smachta scoile: Faoi Acht Oideachais (Leas) 2000 ceanglaítear ar an mbord bainistíochta cód iompair a dhréachtú do mhic léinn ar scoil

source: • Programmes offered: Junior Certificate and Junior Certificate School Programme, Transition Year, established Leaving Certificate, Leaving Certificate Applied, the Leaving Certificate Vocational and other programmes to support personal and social development
ga: • Cláir atá a dtairiscint ag an scoil: Teastas Sóisearach agus Clár Scoile Teastas Sóisearach , Idirbhliain, An Ardteistiméireacht Coitianta, An Ardteistiméireacht Fheidhmeach, Gairmchlár na hArdteistiméireachta agus cláir eile chun tacaíocht a thabhairt d’fhorbairt phearsanta agus sóisialta

source: • Streaming of students: Streaming students means dividing them into different classes for all subjects from the time they start secondary school, based on the school's assessment of their ability
ga: • Chun mic léinn a shruthú: Ciallaíonn sruthú mac léinn iad a chur i ranganna éagsúla do gach ábhar ón lá a thosaíonn siad ar scoil dara leibhéil, bunaithe ar mheasúnacht na scoile ar a gcumas foghlamtha

source: • Assessment of students' progress and feedback to parents and students: Checking of students' progress, feedback to parents, arrangements for parent-teacher meetings
ga: • Measúnacht ar dhul chun cinn na mac léinn agus aiseolas do thuismitheoirí agus do mhic léinn: le dul chun cinn na mac léinn a scrúdú, aiseolas do thuismitheoirí, socruithe le haghaidh cruinnithe tuismitheoirí - múinteoirí

source: • Facilities: What student facilities are provided, for example a library, access to computers, a language laboratory and facilities for lunch, PE and recreation
ga: • Saoráid: Soláthair áiseanna do mhic léinn, mar shampla, leabharlann, rochtain ar ríomhairí, teanglann agus áiseanna do lón, do chorp oideachais agus siamsaíochta

source: • Support services: guidance counsellor, remedial support for students, pastoral care
ga: • Seirbhísí tacaíochta: comhairleoir gairme, tacaíocht feabhais do mhic léinn, cúram tréadach

source: • Extra-curricular activities: sports, clubs, debating etc
ga: • Imeachtaí eachtra-churaclam le fáil

source: • Other factors including the school ethos (details should be in the school plan); student and parental involvement in life of school - whether it has a student council and/or a parents' association
ga: • Tosca eile ina n-áirítear éiteas na scoile (caithfear sonraí bheith i bplean na scoile); páirteachas na mac léinn agus na dtuismitheoirí i saol na scoile – cé acu comhairle na mac léinn nó cumann tuismitheoirí atá ann

source: Enrolling your child at post-primary school
ga: Chun do leanbh a chlárú in iarbhunscoil

source: You can send your child to the post-primary school of your choice, provided there is a place available
ga: Is féidir leat do leanbh a chur chuig do rogha iarbhunscoile, ar choinneáil go bhfuil áit ar fáil dó

source: Where there is an accommodation problem, the school must give priority on the basis of its enrolment policy
ga: Nuair a bhíonn fadhb áite ann, ní mór don scoil tosaíocht a thabhairt ar bhonn a polasaí cláraithe

source: This is drawn up by the board of management and should be available to you on request
ga: Tá sé seo dréachta ag an mbord bainistíochta agus caithfidh sé a bheith ar fáil ar iarratas

source: While most post-primary schools are in a position to enrol all children who apply, there is no automatic guarantee of a place in the school you choose
ga: Cé go mbíonn an chuid is mó iarbhunscoileanna in ann gach leanbh a chuireann isteach a chlárú, ní bhíonn uathrathaíocht áite sa scoil áitiúil

source: Then, you should contact the school of your choice to see if there is a place available
ga: Chun do leanbh a chlárú, ní mór duit liosta iarbhunscoileanna i do cheantar a sheiceáil

source: The school of your choice may place your child on a waiting list or you may need to contact other schools to find a place
ga: Ina dhiaidh sin, ní mór duit dul i dteagmháil le do rogha scoile le feiceáil an bhfuil áit ar fáil inti

source: The Department of Education and Skills held a consultation on the options for the regulation of school enrolment
ga: Is féidir le rogha do scoile do leanbh a chur a liosta feithimh nó is féidir go mbeidh ort dul i dteagmháil le scoileanna eile i do cheantar

source: The vast majority of post-primary schools do not charge fees
ga: Ní ghearrann tromlach mór na n-iarbhunscoileanna táillí

source: However, students must pay for books and examination fees
ga: Ní mór do mhic léinn íoc as leabhair agus táillí scrúdaithe

source: In addition, there are other costs, such as school uniform
ga: Ina theannta sin, tá costais eile ann, ar nós éide scoile

source: There are schemes to help low-income families meet the costs of schooling
ga: Tá scéimeanna ann chun cabhair a thabhairt do theaghlaigh ar ioncam íseal chun costais scolaíochta a ghlanadh

source: The Department of Education and Skills has published a circular on the weight of schoolbags
ga: Tá ciorclán faoi mheáchan málaí scoile ar fáil ar an suíomh gréasáin den Roinn Oideachais agus Scileanna

source: Second-level education consists of a three-year Junior Cycle, followed by a two-year or three-year Senior Cycle
ga: Is é atá san oideachas dara leibhéil ná Córas Sóisearach, agus Córas Sinsearach de dhá bhliana nó thrí bliana ian dhiaidh

source: The Junior Certificate Programme examination is taken at the end of the Junior Cycle
ga: Déantar scrúdú Clár an Teastais Sóisearaigh ag deireadh Córais Sóisearaigh

source: In the Senior Cycle, there is an optional one-year Transition Year programme followed by a choice of three Leaving Certificate programmes
ga: Sa Córas Sinsearach, tá clár Idirbhliana roghnach ar fáil, a leantar le rogha idir thrí Clár Ardteistiméireachta

source: Each of these 3 Leaving Certificate programmes - the Established Leaving Certificate, the Leaving Certificate Applied and the Leaving Certificate Vocational Programme - is a two-year programme
ga: Is clár dhá bhliain gach ceann de na trí chlár Teastas Ardteistiméireachta – an Ardteistiméireacht Choitianta, an Ardteistiméireacht Fheidhmeach agus an Ardteistiméireacht Ghairmiúil

source: Other aspects of post-primary education include:
ga: Áirítear gnéithe eile oideachais iarbhunscoile:

source: • Education for students with special educational needs
ga: • Oideachas do mhic léinn a bhfuil riachtanais oideachais speisialta acu

source: • Equipment grants for students with disabilities
ga: • Socruithe do mhic léinn atá faoi mhíchumas

source: • School transport for post-primary students
ga: • Socruithe speisialta oideachais don lucht taistil

source: • Special educational arrangements for Travellers
ga: • Bearta chun tabhairt faoi míbhuntáistí oideachais

source: • Measures to address educational disadvantage
ga: • Cláir do dhaoine nach bhfuil Béarla acu

source: • Resources for non-English speakers
ga: • Do roghanna agus tú ag fágáil na scoile in Éirinn
